Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: По нажатию на кнопку «Предположить структуру» на странице «Настройка форматов импорта» будут автоматически определены и установлены следующие параметры: разделитель столбцов, ограничитель строк, десятичный разделитель, разделитель даты, разделитель времени, формат даты.
en: When pressing on "Assume structure" button on "Configure Import Formats" page, the following parameters will be automatically defined and set: column delimiter, text qualifier, decimal separator, date separator, time separator, date format. .

source: По умолчанию используется такой же формат сообщений, что и при логировании в файл.
en: The same message format as for logging to file is used by default.

source: По умолчанию корневой wsdl генерируется по адресу /soap?wsdl.
en: By default, root wsdl is generated at the following address:/soap?wsdl.

source: Повторные попытки закрыть сессию не помогали.
en: Repeated attempts to close the session didn't help.

source: Повторный запуск приложения был успешным.
en: The repeated application launch was successful.

source: Повышена производительность работы узлов JavaScript и Сортировка, информативность некоторых сообщений об ошибках.
en: Performance of JavaScript and Sort nodes operation, some error messages comprehension were improved.

source: Повышена производительность.
en: Performance was improved.

source: Повышение информативности
en: UI/UX Improvements

source: Повышение информативности и удобства
en: UI/UX and Usability Improvements

source: Под Linux доступно логирование в journald.
en: Logging in journald is available in Linux.

source: Под Windows данный элемент игнорируется.
en: This element is ignored for Windows.

source: Поддерживается HTTP Basic Authentication, т.е. в URL можно передать логин и пароль.
en: HTTP Basic Authentication is supported. It means that it is possible to transfer login and password in URL.

source: Поддерживается преобразование данных в структуру Pandas DataFrame и обратно.
en: Data transformation to Pandas DataFrame structure and vice versa is supported.

source: Поддерживается только формат xlsx (MS Excel 2007 и выше).
en: Only xlsx format is supported (MS Excel 2007 and higher).

source: Поддержка Python 3.10 позволяет полноценно использовать последние версии популярных библиотек (#9047).
en: Python 3.10 support enables to use the recent versions of the popular libraries in the most efficient way (#9047).

source: Поддержка Python.
en: Python is supported.

source: Поддержка языков программирования
en: Programming languages support

source: Подключение к SQLite в Loginom
en: SQLite Connection in Loginom

source: Подключение по Unix domain socket при использовании docker контейнеров избавляет от необходимости создавать виртуальную сеть между контейнерами.
en: Connection via Unix domain socket when using docker containers eliminates the need to create the virtual network between containers.

source: Подмодель в Loginom
en: Supernode in Loginom

source: Подробная информация об изменениях и особенностях конвертации пакетов описана в разделе Конвертация пакетов более ранних версий в формат 6.5.
en: More detailed information on the changes and special features of packages conversion is available in the following section: Conversion of the earlier version packages to 6.5 format.

source: Подробнее в разделе Изменение в автоматическом формирование имен полей.
en: More detailed information is available in the following section: Change in the automatic fields names generation.

source: Подробнее в разделе Изменения в логировании.
en: More detailed information is available in the following section: Changes in Logging.

source: Подробнее в разделе Изменения в разделе Администрирование.
en: More detailed information is available in the following section: Changes in the Administration Section.

source: Подробнее об изменениях можно узнать из выступления Георгия Киселева на Loginom Days 2020.
en: More detailed information on changes is available in the speech of Georgy Kiselev during Loginom Days 2020.

source: Подсказка, ранее отображаемая для связи, не скрывалась.
en: The tip previously displayed for connection was not hidden.

source: Поиск пакета в текущей папке всё равно происходит, и если он найден, то соответствующая информация добавляется в сообщение об ошибке восстановления ссылки.
en: It is still not possible to find the package in the current folder, and if it is found, the corresponding information is added to the reference restore error message.

source: Пока БД находится в памяти, к ней можно подключиться из другого пакета, но при этом существует разграничение прав доступа на БД SQLite in-memory.
en: While DB is in memory, it is possible to connect to it from another package. Still there is access rights differentiation to DB SQLite in-memory.

source: Получение списка файлов.
en: Get file list.

source: Пользователь увидит сообщение об ошибке только при попытке явно активировать узел, подключенный к неактивной ветви Условия (#3453).
en: A user will see the error message only when explicitly attempting to activate the node connected to the inactive Condition branch (#3453).

source: Помимо ошибок фильтрации, это могло приводить к зависанию веб-приложения, а в результате округления могли возникать дублирующиеся значения (#8748).
en: Apart from the filtration errors, it could freeze web applications and duplicate values could occur (#8748).

source: Попробовать новую версию
en: Try new version

source: Попытки пользователя изменить настройки других используемых полей приводили к появлению ошибки «Не найдена информация по данной интерфейсной ссылке».
en: Attempts of the user to change settings of other used fields caused the following error: "No information on this interface reference found".

source: Порт входных переменных должен быть подключен к активной ветви или не иметь связи (#9367).
en: The input variables port must be connected to the active branch or there must be no connection (#9367).

source: После внесенных исправлений выполнение пакета останавливается, ошибок не возникает (#10110).
en: The package execution stopps after introduced corrections, no errors occur (#10110).

source: После внесенных исправлений для даты 30.12.1899 выводится только время.
en: Only time is displayed after introduced corections for 30.12.1899.

source: После деактивации и повторной активации настройки «Уникальные значения как имена полей», имена столбцов будут формироваться уже по-новому с транслитерацией.
en: After deactivation and repeated activation of "Unique values as field names" setting, the column names will be generated in a new way with transliteration.

source: После исправления алгоритма, как и заявлено, выполняется сравнение без учёта регистра символов.
en: As it was previously stated, comparison was performed after Algorithm correction in a case-insensitive manner.

source: После исправления у пакета, который прежде не открывался, можно будет отредактировать ссылку и восстановить его работу (#9096).
en: Upon correction it will be possible to edit the reference of the package that could not be previously opened and restore its operation (#9096).

source: После нажатия кнопки «Остановить» выдавалось сообщение: «Пустая ссылка на объект».
en: After clicking on "Stop" button the following message was displayed: "Null reference to object".

source: После ошибки таблица оставалась очищенной, экспорт не производился.
en: The table stayed cleared after the error, and export was not executed.

source: После сохранения и повторного открытия мастера настройки Настраиваемое значение "события" сбрасывалось в null (#9356).
en: After saving and repeated wizard opening Configured "event" value was reset to null (#9356).

source: После этой ошибки нельзя было открыть ни один пакет, требовалась перезагрузка сервера (#9156).
en: It was not possible to open packages after this error. It was required to reboot the server (#9156).

source: Поэтому поле на выходе узла становилось переменного типа, вместо указанного типа выходных значений.
en: That is why the field at the node output became variable instead of the specified type of output values.

source: Поэтому, особенно важно обеспечить удобство работы пользователя с конкретным продуктом.
en: That is why it is particularly important to provide the specific product operation convenience for a user.

source: Появилась возможность вывода логов Loginom Integrator в консоль.
en: It became possible to output Loginom Integrator logs to the console.

source: Появилась возможность добавлять заметки на workflow.
en: It became possible to add workflow notes.

source: Появилась возможность задавать из кода структуру выходного набора данных.
en: It became possible to set the output data set structure from the code.

source: Появилась возможность запускать Python в отдельном процессе, в том числе и параллельно.
en: It became possible to start Python in a separate process, as well as simultaneously.

source: Появилась возможность одновременного отображения нескольких фактов на графике диаграммы.
en: It became possible to display several measures simultaneously in the chart graph.

source: Появилась возможность отмены выполнения запроса в процессе импорта из БД.
en: It became possible to cancel the request execution while importing from the DB.

source: Появилась возможность отмены выполнения запроса в процессе импорта из базы данных.
en: It became possible to cancel the request execution while importing from the database.

source: Появилась возможность экспорта в Хранилище данных.
en: It also became possible to export to the Data Warehouse.

source: Появилась интеграция с брокером сообщений Kafka.
en: Integration with Kafka message broker became possible.

source: Появился новый визуализатор – Качество данных, а также реализован ряд улучшений в OLAP-кубе.
en: New visualizer (Data Quality) appeared, and some improvements were introduced into the OLAP cube.

source: Появился новый обработчик и визуализатор, а также улучшены существующие.
en: New handler and visualizer appeared, whereas the existing ones were upgraded.

source: Предпросмотр расчета в мастере Калькулятора.
en: Calculation preview in the Calculator wizard.

source: Предпросмотр расчетов Калькулятора
en: Calculator Calculations Preview

source: Предупреждение "Тип выходных значений не может быть однозначным без замены других", которое высвечивается в этом случае на поле Заменять остальные, заменили на более информативное "Выходные значения будут переменного типа, если не заменить остальные".
en: "Output values type cannot be definite without replacement of others" warning that is displayed in this case in Replace others field was replaced to the following warning that is more informative: "Output values will be variable unless others are replaced".

source: Прежнее поведение могло, в том числе, приводить к ошибкам в визуализаторе Куб #5803 (#8506).
en: The previous behaviour could cause the errors also in the Cube visualizer #5803 (#8506).

source: При экспорте в Loginom Data файл оптимизировано сжатие строковых данных — скорость чтения больших наборов данных увеличилась до 2-х раз.
en: When exporting to the Loginom Data file, the string data compression was optimised. The large data sets read speed was increased by 2 times.

source: При автоматическом добавлении нового пользователя с аутентификацией через LDAP, пользователю выдаются права на публикацию пакетов, если у него есть роль «Проектирование сценариев».
en: When the new user with authentication via LDAP is automatically added, the user becomes entitled to publish the packages if he has "Workflows design" role.

source: При аутентификации пользователя через LDAP сервер разрешено использовать символы русской раскладки.
en: When authenticating a user via the LDAP server, it is allowed to use the Russain layout characters.

source: При вводе имени нового пользователя в разделе Администрирование автоматически убираются ведущие и завершающие пробелы.
en: When entering the new user name, the leading and trailing spaces are automatically deleted in the Administration section.

source: При включенном уровне логирования «Информация», в момент начала выполнения запроса сохраняется URL запроса и имя узла.
en: When the "Info" logging level is enabled, request URL and node name are saved at the time the request execution begins.

source: При восстановлении разорванной ссылки на пакет в текущем пакете вызывается восстановление «сломанных» производных узлов, узлов «Выполнение», «Цикл» и «Узлов-ссылок» (#8981).
en: When the broken reference to package was restored, restoration of the "destroyed" derived nodes, "Execution", "Loop" and Reference nodes" nodes was called in the current package (#8981).

source: При вызове контекстного меню у этого элемента можно было выбрать ошибочно отображаемый пункт «Показать визуализаторы», при этом возникала ошибка «Cannot read property 'NodeIndex' of undefined».
en: When calling the context menu of this element, incorrect selection of shown "Show visualizers" item was possible. In this case, the following error occurred: "Cannot read property 'NodeIndex' of undefined".

source: При выходе из спящего режима в некоторых случаях может быть получено сообщение «Произошёл разрыв связи с сервером» (#10278).
en: When waking from sleep, the following message can be received in some cases: "Server connection lost" (#10278).

source: При запуске настольных редакций Loginom в качестве рабочего каталога устанавливается рабочий каталог, указанный в параметрах ярлыка.
en: When starting the desktop Loginom editions, the working directory specified in the shortcut parameters is installed as the working directory.

source: При запуске сервера после обновления до Loginom 6.5, всем пользователям с правами на проектирование сценариев будут также предоставлены права на публикацию пакетов.
en: When starting the server after update up to Loginom 6.5, all users with workflows design rights will be also entitled to publish packages.

source: При изменении настройки «Сравнивать строковые уникальные значения бинарно», может потребоваться переобучение обученных узлов.
en: When changing "Compare string unique values in a binary way" setting, retraining of trained nodes may be required.

source: При импорте из Хранилища данных появилась возможность отображения данных в виде иерархической (древовидной) структуры, что существенно упрощает настройку импорта данных, если хранилище имеет сложную структуру.
en: When importing from the Data Warehouse, it became possible to display data in the hierarchal (tree-like) structure that can considerably simplify the data import configuration if the warehouse had a complex structure.

source: При импорте из текстового файла для автоматического предположения об используемых типах данных учитываются параметры установленные на странице «Настройка форматов импорта», а также параметр «Кол-во строк для анализа» на странице «Параметры импорта с разделителями».
en: When importing from the text file for the automatic assumption concerning the used data types, the parameters set on "Configure Import Formats" page are taken into account as well as "Row count for analysis" parameter on "Import parameters with separators" page.

source: При импорте форматов txt, csv, xml для предпросмотра или предположения формата скачивается только тот объем данных, который необходим.
en: When importing txt, csv, xml formats for preview or format estimate, only the required data volume is downloaded.

source: При клонировании копируются все атрибуты поля или переменной, кроме значения связанного поля или переменной из исходного набора данных.
en: All field or variable attributes are copied while cloning with the exception of the value of the connected field or variable from the source data set.

source: При конвертации набора данных в структуру Pandas DataFrame используется весь обрабатываемый набор данных, что в некоторых случаях может приводить к существенному замедлению работы сценариев.
en: When converting data set into Pandas DataFrame structure, the whole processed data set is used that can sometimes cause considerable slow-down of the workflows operation.

source: При конвертации пользователь получит соответствующее сообщение.
en: The user will receive corresponding message when converting.

source: При любых ошибках, не позволяющих запустить файловый диалог KDE, будет использоваться файловый диалог GTK (#10153).
en: In the case of any errors that do not allow to start KDE file dialog, GTK file dialog will be used (#10153).

source: При нажатии кнопки "Показатели классов" появлялось предупреждение "Не удалось рассчитать статистику начальных и конечных классов", а должны были рассчитываться фактические показатели.
en: When pressing on "Class indicators" button, the following warning appeared: "Failed to calculate statistics of the fine and coarse classes", whereas it was required to calculate actual indicators.

source: При нажатии на кнопку «Автосохранение», можно включить этот параметр, а также задать «Период сохранения» в минутах.
en: When pressing on "Auto save", it is possible to enable this parameter and also set "Auto save period" in minutes.

source: При нажатии этого пункта в буфер обмена копируются имена выделенных файлов/папок в том порядке, в котором они представлены в таблице.
en: When pressing this item, names of the selected files/folders are copied to the clipboard in the order in which they are represented in the table.

source: При настройке подключения к базе данных SQLite достаточно установить соответствующий флаг и она будет развернута в памяти.
en: When configuring connection to SQLite database, it is sufficient to select corresponding checkbox and it will be expanded in memory.

source: При начальной активации визуализатора рассчитываются только стандартные показатели, такие как: Минимум, Максимум, Среднее, Пропуски.
en: Only such standard indicators as Minimum, Maximum, Average, Null count are calculated when the visualizer is initially activated.

source: При обновлении до новой версии, если уже существует файл логов, то будет использована кодировка ANSI, соответствующая локали пользователя, из под которого запущен Loginom Server.
en: When updating up to the new version, if the log file already exists, ANSI encoding will be used. It complies with the user locale used for Loginom Server start.

source: При обновлении с любых версий 6.хх также необходимы новые лицензии.
en: When updating any 6.хх versions, new licenses are also required.

source: При обращении к отфильтрованному полю при перемещении плашки измерения в область фактов или в список полей происходила ошибка, т.к. отфильтрованное поле нельзя было найти в хранилище.
en: On access to the filtered field when moving the dimension plate to the measures area or list of fields, an error occurred as it was not possible to find the filtered field in the storage.

source: При определении разделителя столбцов учитывается также, что запятая между 2 цифрами может быть разделителем целой и дробной части.
en: When the column delimiter is defined, it is also important to take into account that a comma between 2 digits can be a delimiter of the integer and decimal parts.

source: При оптимизированной сортировке прирост производительности для строковых данных составляет 20%, для числовых данных в 5 раз, для логических значений в 10 раз (#9518).
en: Optimised sorting provided performance increase for the string data up to 20%, up to 5 times for the numeric data and 10 times for the logical values (#9518).

source: При открытии пакетов, содержащих узлы с модификатором доступа «Опубликованный», пользователю будет выдано предупреждение о том, что будет выполнена конвертация пакета и будут созданы дополнительные производные компоненты.
en: When publishing the packages containing the nodes with the "Published" visibility, a user will be warned that the package will be converted and additional derived components will be created.

source: При открытии таких пакетов в Loginom версии 6.5.0 и старше, автоматически создаются производные компоненты по всем узлам, на которые ссылаются узлы Выполнение узла и Цикл в текущем пакете.
en: When opening such packages in Loginom 6.5.0 and higher, the derived components are automatically created for all nodes to which Node Execution and Loop nodes refer in the current package.

source: При отладке возникающих ошибок иногда требовалось включить подробное логирование возникающих ошибок и для этого требовалось перезапустить Loginom Server, поместив рядом с исполняемым файлом специальный файл для записи отладочной информации.
en: When debugging occurring errors, sometimes it was required to enable detailed logging of the occuring errors. For this purpose, it was required to restart Loginom Server placing the special file for debugging information record with the executable file.

source: При ошибках с кодом 400 в REST-сервисе возвращается JSON с описанием ошибки.
en: JSON with error description is returned for the errors with code 400 in REST service.

source: При перезапуске приложения окно также оставалось свернутым (#7467, #8078).
en: When relaunching, the application window was also left collapsed (#7467, #8078).

source: При перетаскивании производного компонента в область сценария по умолчанию создаётся узел Выполнение; если нажат Shift, то создаётся Цикл, а если нажат Ctrl, — то производный узел.
en: When dragging the derived component to the workflow area, Execution node is created by default; if Shift is pressed, Loop is created, and if Ctrl is pressed, the derived node is created.

source: При подаче данных на ранее обученную модель, в визуализаторе Конечные классы появилась возможность сравнить распределение фактических долей интервалов с теми, которые были при обучении.
en: When supplying data to previously trained model, it became possible to compare distribution of actual bin rates with the training ones in Coarse сlasses visualizer.

source: При подготовке релиза основные усилия были направлены на миграцию Loginom на операционную систему Linux.
en: When preparing this release, the main efforts were focused on Loginom migration to Linux operating system.

source: При попытке перейти на нее в дереве каталогов возникала ошибка «System Error.
en: While attempting to move to it in the directory tree, the following error occurred: "System Error".

source: При работе под Linux необходимо задать файл сертификата, ключа и пароля.
en: When working with Linux, it is required to set the certificate file, key and password.

source: При работе с 1С.Предприятие в случае возникновения ошибок было сложно определить, возникли проблемы на стороне 1С или непосредственно в сценариях Loginom.
en: If errors occur when working with 1C.Enterprise, it was complicated to define whether the problems connected with 1C or directly with the Loginom workflows occur.

source: При работе через HTTPS и WebSocket не может быть использована версия TLS ниже 1.2.
en: When working via HTTPS and WebSocket, TLS version below 1.2 cannot be used.

source: При разработке сценария в настройках сервера может быть настроена одна локаль, а на сервере, где будет выполняться разработанный сценарий — другая.
en: When designing the workflow, one locale can be configured in the server settings, and the other one will be configured on the server where the designed workflow will be executed.

source: При расчете количества уникальных значений разные уникальные значения могли учитываться как одно.
en: When calculating the unique values count, different unique values could be counted as one.
